In [227]:
import pandas as pd

In [228]:
data= pd.read_csv("employee_dataset.csv")

In [229]:
df = data

In [230]:
df.head()

,EmpID,Name,Age,Gender,Department,Salary,JoiningDate,PerformanceScore,WorkHours
0,1,Employee_1,50,Female,Sales,90000.0,2015-01-01,3.0,43.0
1,2,Employee_2,36,Male,Finance,62500.0,2015-01-02,2.0,54.0
2,3,Employee_3,29,Male,Finance,39500.0,2015-01-03,1.0,54.0
3,4,Employee_4,42,Male,Sales,35000.0,2015-01-04,4.0,37.0
4,5,Employee_5,40,Male,Finance,41500.0,2015-01-05,4.0,37.0

In [231]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   EmpID             1000 non-null   int64
 1   Name              1000 non-null   object
 2   Age               1000 non-null   int64
 3   Gender            1000 non-null   object
 4   Department        1000 non-null   object
 5   Salary            995 non-null    float64
 6   JoiningDate       1000 non-null   object
 7   PerformanceScore  823 non-null    float64
 8   WorkHours         963 non-null    float64
dtypes: float64(3), int64(2), object(4)
memory usage: 70.4+ KB

In [232]:
df.shape

(1000, 9)

In [233]:
df.isnull().sum()

EmpID                 0
Name                  0
Age                   0
Gender                0
Department            0
Salary                5
JoiningDate           0
PerformanceScore    177
WorkHours            37
dtype: int64

In [234]:
df['Salary'].dropna(inplace=True)

In [235]:
df['Salary'].isnull().sum()

5

In [236]:
df['Salary']=df['Salary'].dropna()

In [237]:
df.isnull().sum()

EmpID                 0
Name                  0
Age                   0
Gender                0
Department            0
Salary                5
JoiningDate           0
PerformanceScore    177
WorkHours            37
dtype: int64

In [238]:
df['Salary'] = pd.to_numeric(df['Salary'])
df['WorkHours'] = pd.to_numeric(df['WorkHours'])

In [239]:
df_cleaned = df.dropna(subset=['Salary','WorkHours'])

In [240]:
df.shape

(1000, 9)

In [241]:
df_cleaned.shape

(958, 9)

In [242]:
df=df_cleaned

In [243]:
df.isnull().sum()

EmpID                 0
Name                  0
Age                   0
Gender                0
Department            0
Salary                0
JoiningDate           0
PerformanceScore    169
WorkHours             0
dtype: int64

In [244]:
df['PerformanceScore'].fillna(df['PerformanceScore'].mean(),inplace=True)

C:\Users\tejas\AppData\Local\Temp\ipykernel_3780\4286025889.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['PerformanceScore'].fillna(df['PerformanceScore'].mean(),inplace=True)
C:\Users\tejas\AppData\Local\Temp\ipykernel_3780\4286025889.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['PerformanceScore'].fillna(df['PerformanceScore'].mean(),inplace=True)

In [254]:
df.isnull().sum()

EmpID               0
Name                0
Age                 0
Gender              0
Department          0
Salary              0
JoiningDate         0
PerformanceScore    0
WorkHours           0
dtype: int64

In [255]:
df.duplicated().sum()

0

In [256]:
df.groupby('Department')['Salary'].mean()

Department
Finance      62582.500000
HR           64302.702703
IT           58803.125000
Marketing    63688.118812
Sales        62011.848341
Name: Salary, dtype: float64

In [257]:
# df.groupby('Department')['Salary','PerformanceScore'].mean()